app/controllers/folders_controller.rb

SELECT `folders`.* FROM `folders` WHERE `folders`.`user_id` IS NULL AND (0)
---
  def list
    folders = Folders.where(user_id: params[:user_id])

SELECT `folders`.* FROM `folders` WHERE `folders`.`folder_id` = 10000 AND `folders`.`user_id` = 10000 AND (0) LIMIT 1
---
  def details
    folder = Folders.where(folder_id: params[:id], user_id: params[:user_id]).first

SELECT `folders`.* FROM `folders` WHERE `folders`.`folder_name` = 'Applications' AND `folders`.`user_id` = 10000 AND (0) LIMIT 1
SELECT MAX(`folders`.`folder_id`) AS max_id FROM `folders` WHERE (0)
INSERT INTO `folders` (`created_at`, `folder_id`, `folder_name`, `is_deleted`, `updated_at`, `user_id`) VALUES ('2021-06-22 12:49:54', 10000, 'Applications', 0, '2021-06-22 12:49:54', 10000)
---
  def insert
    folder_name = params[:folder][:folder_name]
    folder_exists = Folders.exists?(folder_name: folder_name, user_id: params[:user_id])
    if folder_exists
      render json: { error: "duplicate folder name not allowed" }, status: 400
      return
    end

    max_folder_id = Folders.unscoped.maximum("folder_id")
    arg = {
      folder_id:  max_folder_id.nil? ? 10000 : max_folder_id + 1,
      folder_name: folder_name,
      user_id: params[:user_id]
    }

    folder = Folders.new(arg)
    if folder.save

SELECT `folders`.* FROM `folders` WHERE `folders`.`folder_id` = 10000 AND `folders`.`user_id` = 10000 AND (0) LIMIT 1
UPDATE `folders` SET `is_deleted` = 1 WHERE `folders`.`id` = 1
---
  def remove
    begin
      folder = Folders.where(folder_id: params[:id], user_id: params[:user_id]).first
      if folder.nil?
        render json: { error: "folder not found" }, status: 404
      else
        folder.update_column(:is_deleted, true)