app/controllers/notes_controller.rb

SELECT `notes`.* FROM `notes` WHERE (is_deleted=false and user_id= 10000 and folder_id=100012)
---
  def list
    sqlConditions = "is_deleted=false and user_id= #{params[:user_id]}"
    unless params[:folder_id].nil?
      sqlConditions += " and folder_id=#{params[:folder_id]}"
    end
    @notes = Notes.where(sqlConditions)

SELECT `notes`.* FROM `notes` WHERE `notes`.`note_id` = 10000 AND `notes`.`user_id` = 10000 AND `notes`.`is_deleted` = 0 LIMIT 1
---
  def details
    @note = Notes.where(note_id: params[:id], user_id: params[:user_id], is_deleted:false).first

SELECT `folders`.* FROM `folders` WHERE `folders`.`folder_id` = 10013 AND `folders`.`user_id` = 10000 AND `folders`.`is_deleted` = 0 LIMIT 1
SELECT MAX(`notes`.`note_id`) AS max_id FROM `notes`
INSERT INTO `notes` (`created_at`, `folder_id`, `is_deleted`, `note_id`, `notes_description`, `notes_title`, `updated_at`, `user_id`) VALUES ('2021-06-22 16:36:52', 10013, 0, 10000, 'WhatsApp is used for communication', 'WhatsApp', '2021-06-22 16:36:52', 10000)
---
  def insert
    @folderId = params[:note][:folder_id]
    @folder = Folders.where(folder_id: @folderId, user_id: params[:user_id], is_deleted: false).first
    if @folder.nil?
      render json: { error: "folder not found" }, status: 400
      return
    end

    @maxNoteId = Notes.maximum("note_id")
    result = {}
    result[:note_id] = @maxNoteId.nil? ? 10000 : @maxNoteId + 1
    result[:notes_title] = params[:note][:note_title]
    result[:notes_description] = params[:note][:note_description]
    result[:folder_id] = @folderId
    result[:user_id] = params[:user_id]
    result[:is_deleted] = false

    @note = Notes.new(result)
    if @note.save

SELECT `notes`.* FROM `notes` WHERE `notes`.`note_id` = 10001 AND `notes`.`user_id` = 10000 AND `notes`.`is_deleted` = 0 LIMIT 1
SELECT `folders`.* FROM `folders` WHERE `folders`.`folder_id` = 10013 AND `folders`.`user_id` = 10000 AND `folders`.`is_deleted` = 0 LIMIT 1
UPDATE `notes` SET `notes_title` = 'Instagram changed', `notes_description` = 'Insta is used for uploading photos changed', `updated_at` = '2021-06-23 13:13:44' WHERE `notes`.`id` = 2
---
  def update
    @note = Notes.where(note_id: params[:id], user_id: params[:user_id], is_deleted: false).first
    if @note.nil?
      render json: { error: "note not found" }, status: 404
    else
      @folderId = params[:note][:folder_id]
      @folder = Folders.where(folder_id: @folderId, user_id: params[:user_id], is_deleted: false).first
      if @folder.nil?
        render json: { error: "folder not found" }, status: 400
        return
      end

      @note.update_column(:note_title, params[:note][:note_title])

SELECT `notes`.* FROM `notes` WHERE `notes`.`note_id` = 10000 AND `notes`.`user_id` = 10001 AND `notes`.`is_deleted` = 0 LIMIT 1
UPDATE `notes` SET `is_deleted` = 1 WHERE `notes`.`id` = 1
---
  def remove
    begin
      @note = Notes.where(note_id: params[:id], user_id: params[:user_id], is_deleted: false).first
      if @note.nil?
        render json: { error: "note not found" }, status: 404
      else
        @note.update_column(:is_deleted, true)