app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (0)
---
  def list
    @users = Users.all

SELECT `users`.* FROM `users` WHERE `users`.`user_id` = 10001 AND (0) LIMIT 1
---
  def details
    @user = Users.where(user_id: params[:id]).first